tap "homebrew/bundle"
tap "homebrew/core"

tap "beeftornado/rmtree"

# Clone of cat(1) with syntax highlighting and Git integration
# https://github.com/sharkdp/bat
brew "bat"


# UNIX shell (command interpreter)
# https://www.zsh.org/
brew "zsh"

# Plugin manager for zsh, inspired by oh-my-zsh and vundle
# https://antigen.sharats.me
brew "antigen"


# GNU Pretty Good Privacy (PGP) package
# https://gnupg.org/
brew "gnupg"


# CLI tool for quick access to files and directories
# https://github.com/clvv/fasd
brew "fasd"

# Command-line fuzzy finder written in Go
# https://github.com/junegunn/fzf
brew "fzf"

# Simple, fast and user-friendly alternative to find
# https://github.com/sharkdp/fd
brew "fd"

# Code-search similar to ack
# https://github.com/ggreer/the_silver_searcher
brew "the_silver_searcher"

# Display directories as trees (with optional color/HTML output)
# http://mama.indstate.edu/users/ice/tree/
brew "tree"

# GNU File, Shell, and Text utilities
# https://www.gnu.org/software/coreutils
brew "coreutils"


# Get a file from an HTTP, HTTPS or FTP server
# https://curl.haxx.se/
brew "curl"

# Utility that provides fast incremental file transfer
# https://rsync.samba.org/
brew "rsync"


# Lightweight and flexible command-line JSON processor
# https://stedolan.github.io/jq/
brew "jq"

# Make JSON greppable
# https://github.com/tomnomnom/gron
#brew "gron"

# Tool to perform numerical, textual & statistical operations
# https://www.gnu.org/software/datamash
#brew "datamash"

# Terminal utility for exploring and arranging tabular data
# https://visidata.org/
#tap "saulpw/vd"
#brew "saulpw/vd/visidata"


# Improved top (interactive process viewer)
# https://hisham.hm/htop/
brew "htop"

# NCurses Disk Usage
# https://dev.yorhel.nl/ncdu
brew "ncdu"

# Terminal-based visual file manager
# https://www.midnight-commander.org/
brew "midnight-commander"

# Extract, view, and test RAR archives
# https://www.rarlab.com/
#brew "unrar"

# Extraction utility for .zip compressed archives
# https://infozip.sourceforge.io/UnZip.html
#brew "unzip"

# 7-Zip (high compression file archiver) implementation
# https://p7zip.sourceforge.io/
#brew "p7zip"


# Version control system designed to be a better CVS
# https://subversion.apache.org/
brew "subversion"

# Distributed revision control system
# https://git-scm.com
brew "git"

# Git extension for versioning large files
# https://github.com/git-lfs/git-lfs
brew "git-lfs"

# Compute various size metrics for a Git repository
# https://github.com/github/git-sizer
#brew "git-sizer"

# Simple and efficient way to access statistics in git
# https://github.com/arzzen/git-quick-stats
#brew "git-quick-stats"

# Text interface for Git repositories
# https://jonas.github.io/tig/
brew "tig"

# Add GitHub support to git on the command-line
# https://hub.github.com/
brew "hub"

# Color-highlighted diff(1) output
# https://www.colordiff.org/
brew "colordiff"

# Display word differences between text files
# https://www.gnu.org/software/wdiff/
brew "wdiff"

# Good-lookin' diffs with diff-highlight and more
# https://github.com/so-fancy/diff-so-fancy
brew "diff-so-fancy"


# Open source programming language to build simple/reliable/efficient software
# https://golang.org
brew "go"

# Interpreted, interactive, object-oriented programming language
# https://www.python.org/
brew "python"

# Bash completion for Pip
# https://github.com/ekalinin/pip-bash-completion
#brew "pip-completion"
