tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "beeftornado/rmtree"

brew "zsh"
brew "antigen"
brew "fasd"
brew "fzf"

brew "bash"
brew "bash-completion"
brew "coreutils"

brew "curl"
brew "wget"

brew "ack"
brew "jq"
brew "tree"

brew "htop"
brew "ncdu"
brew "rsync"
brew "tmux"
brew "p7zip"

brew "subversion"
brew "git"
brew "git-lfs"
brew "hub"

brew "dpkg"

brew "python"
brew "python3"
brew "pip-completion"
brew "ansible"

brew "lastpass-cli", args: ["with-pinentry"]

################
# Core stuff
################

# cask "alfred"

# cask "yandex"
# cask "google-chrome"

# # Pretty window manager
# cask "spectacle"

# cask "choosy"

# Finder extensions such as tabs
cask "xtrafinder"

cask "telegram-desktop"


# ################
# # Dev stuff
# ################

# cask "iterm2"

# # Editors
# cask "sublime-text"
# # ln -fs ~/Applications/Sublime\ Text.app/Contents/SharedSupport/bin/subl /usr/local/bin/subl
# # cask "intellij-ultimate"

# cask "postman"

# ################
# # Optional stuff
# ################

# # Automatically adjust screen color temperature
# cask "flux"

# cask "ilya-birman-typography-layout"

# cask "steam"
