tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"

brew "zsh"
brew "antigen"
brew "bash"
brew "bash-completion"
brew "coreutils"

brew "fasd"
brew "fzf"
brew "fd"
brew "the_silver_searcher"
brew "tree"

brew "curl"
brew "wget"
brew "rsync"

# Data mining & analysis
brew "jq"
brew "jid"
brew "datamash"
brew "saulpw/vd/visidata"

brew "htop"
brew "ncdu"
brew "tmux"
brew "p7zip"
brew "midnight-commander"

brew "subversion"
brew "git"
brew "git-lfs"
brew "git-sizer"
brew "tig"
brew "hub"
brew "colordiff"
brew "wdiff"
brew "diff-so-fancy"

brew "python"
brew "python3"
brew "pip-completion"

# brew "dpkg"
# brew "ansible"

# brew "lastpass-cli", args: ["with-pinentry"]

################
# Core stuff
################

# cask "alfred"

# cask "yandex"
# cask "google-chrome"

# # Pretty window manager
# cask "spectacle"

# cask "choosy"

# Finder extensions such as tabs
# cask "xtrafinder"

# cask "telegram-desktop"


# ################
# # Dev stuff
# ################

# cask "iterm2"

# # Editors
# cask "sublime-text"
# # ln -fs ~/Applications/Sublime\ Text.app/Contents/SharedSupport/bin/subl /usr/local/bin/subl
# # cask "intellij-ultimate"

# cask "postman"

# ################
# # Optional stuff
# ################

# # Automatically adjust screen color temperature
# cask "flux"

# cask "ilya-birman-typography-layout"

# cask "steam"
